{"images": [{"review_topic_info": [3, 0.6999136716239791, ["french", "bread"]], "images_info": [1566, 5245, 5245, 8017, 14968, 16086, 24410, 24410, 27902, 29787, 30214, 39011, 40364, 41139, 44957, 47209, 52064, 52138, 53841, 54683, 60205], "text": "What a delightful surprise we got at Mon Ami Gabi!!! \n\nI had some of the most scrumptious French toast I have ever had the pleasure of eating! Brent had an omelette that was, well, there's no other word but perfect! They also bring out tasty bread and homemade jams while you wait. \n\nThe coffee is amazing. The ambiance, the wait staff, everything about this place was thoroughly enjoyable. \n\nI'm only sorry we didn't have a chance to return to this fabulous spot during our trip to have dinner. We will be back the very first chance we get!"}, {"review_topic_info": [7, 0.8499712288618089, ["patio", "bellagio", "fountains", "patio", "fountains"]], "images_info": [170, 170, 170, 3053, 3053, 9473, 9473, 10173, 10173, 10967, 10967, 11353, 11353, 11353, 12036, 13205, 13232, 13232, 13624, 13624, 18008, 18749, 18749, 18749, 18804, 20692, 20692, 22401, 22401, 22401, 25902, 25902, 28882, 28882, 28882, 30644, 32052, 32052, 32052, 32940, 48495, 48495, 53113, 55810, 55810], "text": "On our last night in Vegas I took my wife here for a late dinner. This location had been recommended by a local for the romantic atmosphere. We sat on the patio which sits facing the Bellagio. We didn't eat until almost 8PM, the fountains where putting on their show every 15 minutes giving it a little extra to the atmosphere.\n\n The Service was remarkable. Our waiter was very helpful and friendly, answering my questions. He asked if we wanted a bottle of wine. At first I said no, but changed my mind as it was our last night in Vegas and I wanted to have a special dinner with my wife. Of course I know nothing about wine. My palette is mainly attuned for beer and spirits. The waiter asked some questions then made a recommendation. His recommendation was spot on. I really wish I could remember the name of the wine as we both loved it. \n\nFor an appetizer we ordered the Country Pate. We both enjoyed it. It had a rich flavor, but it wasn't overpowering. It was a great way to start the meal. \n\nThe main course my wife wanted the Seafood Platter for two: Lobster, shrimp, oysters, tuna tartar and seaweed salad. The shrimp were huge. The lobster was delicious and cooked perfectly. My wife didn't like the oysters, but I enjoyed them. The tuna tartar had a great flavor and was combined with avocado that helped balance out the tuna. Neither one of us liked the seaweed salad, but I think that's a personal taste issue. The best part of the meal was the sauce they provided for the lobster, it was like a horseradish mustard. The tasted fantastic! Definitely worth a try. \n\nWe contemplated ordering dessert, but we were both full. \n\nIf you go, and the weather is right, I would recommend sitting on the Patio. The combination of the fountains, the décor and being able to watch people walking up and down the strip made for a fun evening. \n\nOverall the entire experience was amazing. I would definitely go back if I ever go to Vegas again."}, {"review_topic_info": [1, 0.5165023123737553, ["blue", "cheese"]], "images_info": [14610, 18674, 18674, 32643, 39011, 53587, 60337], "text": "I have two favorite steakhouses in Las Vegas. This is one and the other is a green building that I wont mention next to MGM Grand.\n\nMon Ami Gabi really shines in the steaks that are served with something. I can't recall exactly what it was but I believe it was the blue cheese. The wine list here is pretty good and most of the reds compliment the steaks very well. We had a large party of 10 for a bachelor pad and the seated us quickly (without reservations) and the service was spot on.\n\nThe view is nice and romantic for couples. Inside is more where the family action is at. I always look to this as one of my defaults if I do know want to search for food. How can you go wrong with the potatoe frites and a great fillet and a red wine?"}, {"review_topic_info": [6, 0.76317483155013, ["french", "onion", "soup", "soup", "cheese", "french", "onion", "soup", "soup"]], "images_info": [5245, 5245, 12369, 12369, 14610, 14968, 14968, 14968, 14968, 14968, 14968, 14968, 14968, 16086, 16086, 18674, 24410, 24410, 27902, 27902, 29787, 29787, 29787, 29787, 29787, 29787, 29787, 29787, 30214, 30214, 30214, 30214, 30214, 30214, 30214, 30214, 32643, 39011, 39011, 39011, 39011, 39011, 39011, 39011, 39011, 39011, 41139, 41139, 52064, 52064, 52064, 52064, 52064, 52064, 52064, 52064, 53587, 53841, 53841, 54683, 54683, 54683, 54683, 54683, 54683, 54683, 54683, 60205, 60205, 60337], "text": "With a girlfriend of mine, went here twice on our vacay to Vegas and absolutely loved it. The first night, before heading out for the night, we got dressed up and decided to have a fancy dinner. Their fresh, warm baguettes are AMAZING. We both had the French Onion soup and shared a bottle of their house Chardonnay. The soup was soooooo delicious. Burnt cheese is always delicious. Brothy and full of flavor, I don't think I've ever had a better French onion soup. Their wine was yummy, but we are not wine connoisseurs, so we could really have cared less- just wanted to catch a buzz. Our waitress wasn't the greatest. A little slow and seems disinterested in our table.\n\n The second time, we grabbed lunch. Baguette was a little hard, but still tasty. My friend got the soup again and I swear it tasted EVEN better than the night before. I had the Shrimp Cocktail and it was delish. Jumbo shrimp were served on ice with a really yummy cocktail sauce with fresh garlic on top. So good! Much better service this time around."}]}